<a href="https://colab.research.google.com/github/manish9857/food_demand_forecasting/blob/master/food_demand_forecasting.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df_dev = pd.read_csv("train.csv")
df_test = pd.read_csv("test_QoiMO9B.csv")
df_meal = pd.read_csv("meal_info.csv")
df_center = pd.read_csv("fulfilment_center_info.csv")

In [5]:
df_dev.head()

        id  week  ...  homepage_featured  num_orders
0  1379560     1  ...                  0         177
1  1466964     1  ...                  0         270
2  1346989     1  ...                  0         189
3  1338232     1  ...                  0          54
4  1448490     1  ...                  0          40

[5 rows x 9 columns]

In [4]:
df_dev.isnull().sum()

id                       0
week                     0
center_id                0
meal_id                  0
checkout_price           0
base_price               0
emailer_for_promotion    0
homepage_featured        0
num_orders               0
dtype: int64

In [6]:
df_test.head()

        id  week  ...  emailer_for_promotion  homepage_featured
0  1028232   146  ...                      0                  0
1  1127204   146  ...                      0                  0
2  1212707   146  ...                      0                  0
3  1082698   146  ...                      0                  0
4  1400926   146  ...                      0                  0

[5 rows x 8 columns]

In [8]:
df_meal.head()

   meal_id   category cuisine
0     1885  Beverages    Thai
1     1993  Beverages    Thai
2     2539  Beverages    Thai
3     1248  Beverages  Indian
4     2631  Beverages  Indian

In [9]:
df_center.head()

   center_id  city_code  region_code center_type  op_area
0         11        679           56      TYPE_A      3.7
1         13        590           56      TYPE_B      6.7
2        124        590           56      TYPE_C      4.0
3         66        648           34      TYPE_A      4.1
4         94        632           34      TYPE_C      3.6